import React, { useState } from 'react';
import {Container , Row , Col, Form, ButtonGroup, Button} from "react-bootstrap";

export default function SignWithUs() {
    const [ name , setName] = useState("");
    const [ phoneNo , setPhoneNo] = useState("");
    const [ age , setAge] = useState("");
    const [ country , setCountry] = useState("");
    const [ email , setEmail] = useState("");
    const [ textArea , setTextArea] = useState("");

    const handleOnSubmit = (e)=>{
        e.preventDefault();
    }
  return (
    <Container className='py-5 signwithus-section'>
        <Row>
            <Col lg={4} className='my-4'>
                <div className="sign-right px-4 py-5 fs-5">
                    <div className='ms-auto py-4'>
                        <span className='mx-3'>
                            <svg width="28" height="23" viewBox="0 0 28 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M24.6667 0.833008H3.33341C1.86275 0.833008 0.666748 2.02901 0.666748 3.49967V19.4997C0.666748 20.9703 1.86275 22.1663 3.33341 22.1663H24.6667C26.1374 22.1663 27.3334 20.9703 27.3334 19.4997V3.49967C27.3334 2.02901 26.1374 0.833008 24.6667 0.833008ZM24.6667 3.49967V4.18101L14.0001 12.4783L3.33341 4.18234V3.49967H24.6667ZM3.33341 19.4997V7.55834L13.1814 15.2183C13.4149 15.4017 13.7032 15.5014 14.0001 15.5014C14.297 15.5014 14.5853 15.4017 14.8187 15.2183L24.6667 7.55834L24.6694 19.4997H3.33341Z" fill="white"/>
                            </svg>
                        </span>
                        <span>acadimy@gmail.com</span>
                    </div>
                    <div className='ms-auto py-4'>
                        <span className='mx-3'>
                            <svg width="28" height="27" viewBox="0 0 28 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M24.6667 0.166992H3.33341C1.86275 0.166992 0.666748 1.36299 0.666748 2.83366V18.8337C0.666748 20.3043 1.86275 21.5003 3.33341 21.5003H7.33342V26.523L15.7027 21.5003H24.6667C26.1374 21.5003 27.3334 20.3043 27.3334 18.8337V2.83366C27.3334 1.36299 26.1374 0.166992 24.6667 0.166992ZM24.6667 18.8337H14.9641L10.0001 21.811V18.8337H3.33341V2.83366H24.6667V18.8337ZM7.33342 6.83366H20.6667V9.50033H7.33342V6.83366ZM7.33342 12.167H16.6667V14.8337H7.33342V12.167Z" fill="white"/>
                            <path d="M24.6667 0.166992H3.33341C1.86275 0.166992 0.666748 1.36299 0.666748 2.83366V18.8337C0.666748 20.3043 1.86275 21.5003 3.33341 21.5003H7.33342V26.523L15.7027 21.5003H24.6667C26.1374 21.5003 27.3334 20.3043 27.3334 18.8337V2.83366C27.3334 1.36299 26.1374 0.166992 24.6667 0.166992ZM24.6667 18.8337H14.9641L10.0001 21.811V18.8337H3.33341V2.83366H24.6667V18.8337ZM7.33342 6.83366H20.6667V9.50033H7.33342V6.83366ZM7.33342 12.167H16.6667V14.8337H7.33342V12.167Z" fill="white"/>
                            </svg>
                        </span>
                        <span>acadimy@gmail.com</span>
                    </div>
                    <div className='ms-auto py-4'>
                        <span className='mx-3'>
                            <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M19.6095 13.8903C19.4857 13.7664 19.3388 13.668 19.177 13.601C19.0153 13.5339 18.8419 13.4993 18.6668 13.4993C18.4917 13.4993 18.3183 13.5339 18.1565 13.601C17.9948 13.668 17.8478 13.7664 17.7241 13.8903L15.5988 16.0156C14.6135 15.7223 12.7748 15.0556 11.6095 13.8903C10.4441 12.7249 9.77745 10.8863 9.48412 9.90095L11.6095 7.77562C11.7334 7.6519 11.8317 7.50496 11.8988 7.34321C11.9659 7.18145 12.0004 7.00806 12.0004 6.83295C12.0004 6.65784 11.9659 6.48445 11.8988 6.32269C11.8317 6.16094 11.7334 6.014 11.6095 5.89028L6.27612 0.55695C6.1524 0.433023 6.00546 0.334706 5.84371 0.267625C5.68196 0.200544 5.50856 0.166016 5.33345 0.166016C5.15834 0.166016 4.98495 0.200544 4.82319 0.267625C4.66144 0.334706 4.5145 0.433023 4.39079 0.55695L0.774786 4.17295C0.26812 4.67962 -0.0172139 5.37562 -0.00654721 6.08628C0.0241195 7.98495 0.526786 14.5796 5.72412 19.7769C10.9215 24.9743 17.5161 25.4756 19.4161 25.5076H19.4535C20.1575 25.5076 20.8228 25.2303 21.3268 24.7263L24.9428 21.1103C25.0667 20.9866 25.165 20.8396 25.2321 20.6779C25.2992 20.5161 25.3337 20.3427 25.3337 20.1676C25.3337 19.9925 25.2992 19.8191 25.2321 19.6574C25.165 19.4956 25.0667 19.3487 24.9428 19.225L19.6095 13.8903ZM19.4401 22.8396C17.7761 22.8116 12.0828 22.365 7.60945 17.8903C3.12145 13.4023 2.68679 7.68895 2.66012 6.05828L5.33345 3.38495L8.78145 6.83295L7.05745 8.55695C6.90073 8.71355 6.78551 8.90673 6.72219 9.11904C6.65887 9.33135 6.64945 9.55609 6.69479 9.77295C6.72679 9.92628 7.50945 13.5623 9.72278 15.7756C11.9361 17.9889 15.5721 18.7716 15.7255 18.8036C15.9422 18.8502 16.1672 18.8416 16.3796 18.7784C16.5921 18.7153 16.7853 18.5997 16.9415 18.4423L18.6668 16.7183L22.1148 20.1663L19.4401 22.8396Z" fill="white"/>
                            </svg>
                        </span>
                        <span>92003231027</span>
                    </div>
                    <div className='ms-auto py-4'>
                        <span className='mx-3'>
                            <svg width="22" height="27" viewBox="0 0 22 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11 16.167C13.9413 16.167 16.3333 13.775 16.3333 10.8337C16.3333 7.89233 13.9413 5.50033 11 5.50033C8.05867 5.50033 5.66667 7.89233 5.66667 10.8337C5.66667 13.775 8.05867 16.167 11 16.167ZM11 8.16699C12.4707 8.16699 13.6667 9.36299 13.6667 10.8337C13.6667 12.3043 12.4707 13.5003 11 13.5003C9.52933 13.5003 8.33333 12.3043 8.33333 10.8337C8.33333 9.36299 9.52933 8.16699 11 8.16699ZM10.2267 26.5857C10.4524 26.7468 10.7227 26.8334 11 26.8334C11.2773 26.8334 11.5477 26.7468 11.7734 26.5857C12.1787 26.299 21.7054 19.4203 21.6667 10.8337C21.6667 4.95233 16.8814 0.166992 11 0.166992C5.1187 0.166992 0.333369 4.95233 0.333369 10.827C0.294703 19.4203 9.82137 26.299 10.2267 26.5857ZM11 2.83366C15.412 2.83366 19 6.42166 19 10.8403C19.028 16.7577 13.1494 22.071 11 23.8137C8.85204 22.0697 2.97204 16.755 3.00004 10.8337C3.00004 6.42166 6.58804 2.83366 11 2.83366Z" fill="white"/>
                            <path d="M11 16.167C13.9413 16.167 16.3333 13.775 16.3333 10.8337C16.3333 7.89233 13.9413 5.50033 11 5.50033C8.05867 5.50033 5.66667 7.89233 5.66667 10.8337C5.66667 13.775 8.05867 16.167 11 16.167ZM11 8.16699C12.4707 8.16699 13.6667 9.36299 13.6667 10.8337C13.6667 12.3043 12.4707 13.5003 11 13.5003C9.52933 13.5003 8.33333 12.3043 8.33333 10.8337C8.33333 9.36299 9.52933 8.16699 11 8.16699ZM10.2267 26.5857C10.4524 26.7468 10.7227 26.8334 11 26.8334C11.2773 26.8334 11.5477 26.7468 11.7734 26.5857C12.1787 26.299 21.7054 19.4203 21.6667 10.8337C21.6667 4.95233 16.8814 0.166992 11 0.166992C5.1187 0.166992 0.333369 4.95233 0.333369 10.827C0.294703 19.4203 9.82137 26.299 10.2267 26.5857ZM11 2.83366C15.412 2.83366 19 6.42166 19 10.8403C19.028 16.7577 13.1494 22.071 11 23.8137C8.85204 22.0697 2.97204 16.755 3.00004 10.8337C3.00004 6.42166 6.58804 2.83366 11 2.83366Z" fill="white"/>
                            </svg>
                        </span>
                        <span>السعودية</span>
                    </div>
                </div>
            </Col>
            <Col lg={8} className='px-5 my-4'>
                <Row>
                    <h1 className='my-4'>سجل معنا الان </h1>
                    <small>املأ الاستمارة التالية للتسجيل في الاكاديمية</small>
                </Row>
                <Row className='my-2'>
                    <div className='p-2 form-border'>
                        <Form onSubmit={handleOnSubmit}>
                            <Form.Group className='row my-2'>
                                <Col lg={6} md={6}>
                                    <Form.Control  placeholder='الاسم كامل*' type='name' name='name' value={name} onChange={(e)=>{setName(e.target.value)}}  required/>
                                </Col>
                                <Col lg={6} md={6}>
                                    <Form.Control  placeholder='رقم الجوال*' type='number' name='phoneNo' value={phoneNo} onChange={(e)=>{setPhoneNo(e.target.value)}}  required/>
                                </Col>
                            </Form.Group>
                            <Form.Group className='row my-3'>
                                <Col lg={6} md={6}>
                                    <Form.Control  placeholder='العمر*' type='number' name='age' value={age} onChange={(e)=>{setAge(e.target.value)}}  required/>
                                </Col>
                                <Col lg={6} md={6}>
                                    <Form.Control  placeholder='مكان البلد*' type='text' name='country' value={country} onChange={(e)=>{setCountry(e.target.value)}}  required/>
                                </Col>
                            </Form.Group>
                            <Form.Group className='row my-3'>
                                <Col>
                                    <Form.Control placeholder='عنوان البريد الاكتروني*' type='email' name='email' value={email} onChange={(e)=>{setEmail(e.target.value)}} required />
                                </Col>
                            </Form.Group>
                            <Form.Group className='row my-3'>
                                <Col>
                                    <textarea className='form-control' placeholder='اكتب نبذة عن مهاراتك و تجاربك ...' rows="4"  type='text' name='textArea' value={textArea} onChange={(e)=>{setTextArea(e.target.value)}} required ></textarea>
                                </Col>
                            </Form.Group>
                            <Form.Group className='row my-2'>
                                <Col lg={12} className='row px-2'>
                                <Button className='' type='submit'>
                                    ارسال
                                </Button>
                                </Col>
                                
                            </Form.Group>
                            
                        </Form>
                    </div>
                </Row>
            </Col>
        </Row>
    </Container>
  )
}
